統計テスト1 = c( 6,10,6,10,5,3,5, 9,3,3,11, 6,11, 9, 7,5,8, 7,7,9)
統計テスト2 = c(10,13,8,15,8,6,9,10,7,3,18,14,18,11,12,5,7,12,7,7)

# 散布図
plot(統計テスト1, 統計テスト2)

# 共分散
共分散 = mean((統計テスト1 - mean(統計テスト1)) * (統計テスト2 - mean(統計テスト2)))
共分散

# 不偏共分散(要素数 - 1で割る)
不偏共分散 = cov(統計テスト1, 統計テスト2)
不偏共分散

# 相関係数 (:= 共分散 / 全ての変数の偏差の積)
相関係数 = 不偏共分散 / (sd(統計テスト1) * sd(統計テスト2))
相関係数
cor(統計テスト1, 統計テスト2) # 上と同じ

# クロス集計
数学 = c("嫌い","嫌い","好き","好き","嫌い","嫌い","嫌い","嫌い","嫌い", "好き","好き","嫌い","好き","嫌い","嫌い","好き","嫌い","嫌い","嫌い","嫌い")
統計 = c("好き","好き","好き","好き","嫌い","嫌い","嫌い","嫌い","嫌い", "嫌い","好き","好き","好き","嫌い","好き","嫌い","嫌い","嫌い","嫌い","嫌い")
table(数学, 統計)

# ファイ係数
数学イチゼロ = ifelse(数学=="好き",1,0)
統計イチゼロ = ifelse(統計=="好き",1,0)
table(数学イチゼロ, 統計イチゼロ)
ファイ係数 = cor(数学イチゼロ, 統計イチゼロ)
ファイ係数

