# (1)
勉強時間 = c(1,3,10,12,6,3,8,4,1,5)
定期試験の得点 = c(20,40,100,80,50,50,70,50,10,60)
plot(勉強時間, 定期試験の得点)

# (2)
相関係数 = cor(勉強時間, 定期試験の得点)
相関係数

# (3)
和洋 <- c("洋食","和食","和食","洋食","和食","洋食","洋食","和食","洋食", "洋食","和食","洋食","和食","洋食","和食","和食","洋食","洋食","和食","和食")
甘辛 <- c("甘党","辛党","甘党","甘党","辛党","辛党","辛党","辛党","甘党", "甘党","甘党","甘党","辛党","辛党","甘党","辛党","辛党","甘党","辛党","辛党")
クロス集計表 = table(和洋, 甘辛)
クロス集計表

# (4)
和洋ゼロイチ = ifelse(和洋=="洋食", 1, 0)
甘辛ゼロイチ = ifelse(甘辛=="甘党", 1, 0)
ファイ係数 = cor(和洋ゼロイチ, 甘辛ゼロイチ)
ファイ係数