心理学テスト <- c(13,14,7,12,10,6,8,15,4,14,9,6,10,12,5,12,8,8, 12,15)
# 5.3 標準正規分布を用いた検定
z統計量 = (mean(心理学テスト) - 12) / (sqrt(10 / length(心理学テスト)))
z統計量

## 棄却域
qnorm(0.025)
qnorm(0.975)

## p値
2 * pnorm(z統計量)

# 5.4 t分布を用いた検定
t統計量 = (mean(心理学テスト) - 12) / (sqrt(var(心理学テスト) / length(心理学テスト)))
t統計量

## 棄却率
自由度 = length(心理学テスト) - 1
自由度
qt(0.025, 自由度)
qt(0.975, 自由度)

## p値
pt(t統計量, 自由度)

## t検定を行うR標準関数
t.test(心理学テスト, mu = 12)

# 5.5 相関係数の検定
統計テスト1 <- c(6,10,6,10,5,3,5,9,3,3,11,6,11,9,7,5,8,7,7,9)
統計テスト2 <- c(10,13,8,15,8,6,9,10,7,3,18,14,18,11,12,5,7,12,7,7)

標本相関 = cor(統計テスト1, 統計テスト2)
標本相関

自由度 = length(統計テスト1) - 2
t統計量 = (標本相関 * sqrt(自由度)) / (sqrt(1 - 標本相関^2))
t統計量
2 * pt(t統計量, 自由度, lower.tail = FALSE)

## 無相関検定を行うR標準関数
cor.test(統計テスト1, 統計テスト2)

# 5.6 独立性の検定(カイ二乗検定)
数学 = c("嫌い","嫌い","好き","好き","嫌い","嫌い","嫌い","嫌い","嫌い", "好き","好き","嫌い","好き","嫌い","嫌い","好き","嫌い","嫌い","嫌い","嫌い")
統計 = c("好き","好き","好き","好き","嫌い","嫌い","嫌い","嫌い","嫌い", "嫌い","好き","好き","好き","嫌い","好き","嫌い","嫌い","嫌い","嫌い","嫌い")
table(数学, 統計)

## カイ二乗分布
curve(dchisq(x,2), 0, 20)
curve(dchisq(x,1), 0, 20, add=TRUE)
curve(dchisq(x,4), 0, 20, add=TRUE)
curve(dchisq(x,8), 0, 20, add=TRUE)
curve(dchisq(x,16), 0, 20, add=TRUE)

## 期待度
期待度11 = 12*14/20
期待度21 = 12*6/20
期待度12 = 8*14/20
期待度22 = 8*6/20
期待度数 = c(期待度11, 期待度21, 期待度12, 期待度22)
期待度数

## カイ二乗
観測度数 = c(10,2,4,4)

カイ二乗要素 = (観測度数 - 期待度数)^2 / 期待度数
カイ二乗要素

カイ二乗 = sum(カイ二乗要素)
カイ二乗

qchisq(0.95, 1)

## p値
pchisq(カイ二乗, 1, lower.tail = FALSE)

## カイ二乗検定を行うR標準関数
クロス集計表 = table(数学, 統計)
chisq.test(クロス集計表, correct = FALSE)
